tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# brew "htop"
# brew "mkcert"
# brew "nss"
brew "node"
brew "git"
brew "zsh"
brew "gh"
brew "diff-so-fancy"
# software tools
cask "1password"
cask "notion"
cask "spotify"
cask "google-backup-and-sync"
cask "alfred"
# communication
cask "zoom"
cask "signal"
cask "franz"
# cask "slack"
# browsers
cask "google-chrome"
cask "firefox"
# code
cask "visual-studio-code"
cask "iterm2"
# design tools
cask "sim-daltonism" # color blind ness simulator
cask "figma"
cask "sketch"
cask "abstract" # sketch versioning
# cask "zeplin"
cask "affinity-publisher"
cask "affinity-photo"
cask "affinity-designer"
# tools
# cask "macmediakeyforwarder" # allows spotify to react to play and pause buttons (deprecated)
cask "beardedspice" # allows spotify to react to play and pause buttons
cask "lulu" # similiar to little snitch
cask "ukelele" # create custom keyboard layouts
cask "obs" # to connect EOS camera to webex
# plugins
cask "qlcolorcode"
cask "qlstephen"
# cask "qlmarkdown"
cask "sbarex-qlmarkdown"
cask "quicklook-json"
cask "qlprettypatch"
cask "quicklook-csv"
cask "betterzip"
cask "webpquicklook"
cask "suspicious-package"
