tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# brew "htop"
# brew "mkcert"
# brew "nss"
brew "node"
brew "git"
brew "zsh"
brew "pure"
brew "diff-so-fancy"
# software tools
cask "1password"
cask "1password/tap/1password-cli"
cask "obsidian"
cask "spotify"
cask "google-drive"
cask "raycast"
# communication
cask "zoom"
cask "signal"
# cask "obs"
cask "opal-composer"
cask "slack"
cask "clipgrab"
# browsers
cask "google-chrome"
cask "firefox"
# code
cask "visual-studio-code"
cask "codewhisperer" # previous fig
# cask "iterm2"
# design tools
cask "sim-daltonism" # color blindness simulator
# cask "contraste" # color contrast checker
cask "figma"
cask "affinity-publisher"
cask "affinity-photo"
cask "affinity-designer"
# tools
# cask "macmediakeyforwarder" # allows spotify to react to play and pause buttons (deprecated)
cask "reflex" # allows spotify to react to play and pause buttons
# cask "lulu" # similiar to little snitch
cask "finicky" # open links in the right browser use config file from this repo
# cask "ukelele" # create custom keyboard layouts
# cask "obs" # to connect EOS camera to webex
# Quicklook plugins
cask "qlcolorcode" # quicklook syntax highlight
cask "qlstephen" # quicklook view text files without extensions
# cask "qlmarkdown"
cask "qlmarkdown"
cask "quicklook-json"
# cask "qlprettypatch"
cask "quicklook-csv"
cask "betterzip"
cask "webpquicklook"
# cask "suspicious-package" # show appe package content in quicklook
