tap "homebrew/bundle"
# brew "htop"
# brew "mkcert"
# brew "nss"
brew "node"
brew "git"
brew "zsh"
brew "pure"
brew "diff-so-fancy"
brew "ffmpeg"
# software tools
cask "1password"
cask "1password/tap/1password-cli"
cask "obsidian"
cask "spotify"
cask "google-drive"
cask "raycast"
# browsers
cask "google-chrome"
cask "firefox"
# essentials
cask "figma"
cask "visual-studio-code"
cask "codewhisperer" # previous fig
# communication
cask "zoom"
cask "signal"
# cask "obs"
cask "opal-composer"
cask "slack"
cask "4k-video-downloader+"
cask "vlc"
# eBooks
cask "calibre"
cask "adobe-digital-editions"
# design tools
cask "sim-daltonism" # color blindness simulator
cask "affinity-publisher"
cask "affinity-photo"
cask "affinity-designer"
cask "cleanshot"
# tools
cask "opal-composer"
cask "elgato-control-center"
cask "reflex" # allows spotify to react to play and pause buttons
cask "logi-options+"
# cask "lulu" # similiar to little snitch
cask "finicky" # open links in the right browser use config file from this repo
# Quicklook plugins
cask "qlcolorcode" # quicklook syntax highlight
cask "qlstephen" # quicklook view text files without extensions
cask "qlmarkdown"
cask "quicklook-json"
cask "quicklook-csv"
cask "betterzip"
cask "webpquicklook"
# fonts
cask "font-inter"
cask "font-ibm-plex"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-serif"
cask "font-ibm-plex-sans"
cask "font-league-gothic"
cask "font-fira-code"